HAMES2-1st-3/TunnelComfortSystemTesting/include/tc37xa/IfxEbcu_bf.h
/**
 * \file IfxEbcu_bf.h
 * \brief
 * \copyright Copyright (c) 2018 Infineon Technologies AG. All rights reserved.
 *
 *
 * Version: TC37x_TS_V2.6.0.R0
 * Specification: TC3xx Target Specification.V2.6.0
 * MAY BE CHANGED BY USER [yes/no]: No
 *
 *                                 IMPORTANT NOTICE
 *
 *
 * Infineon Technologies AG (Infineon) is supplying this file for use
 * exclusively with Infineon's microcontroller products. This file can be freely
 * distributed within development tools that are supporting such microcontroller
 * products.
 *
 * THIS SOFTWARE IS PROVIDED "AS IS".  NO WARRANTIES, WHETHER EXPRESS, IMPLIED
 * OR STATUTORY, INCLUDING, BUT NOT LIMITED TO, IMPLIED WARRANTIES OF
 * MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE APPLY TO THIS SOFTWARE.
 * INFINEON SHALL NOT, IN ANY CIRCUMSTANCES, BE LIABLE FOR SPECIAL, INCIDENTAL,
 * OR CONSEQUENTIAL DAMAGES, FOR ANY REASON WHATSOEVER.
 *
 * \defgroup IfxSfr_Ebcu_Registers_BitfieldsMask Bitfields mask and offset
 * \ingroup IfxSfr_Ebcu_Registers
 * 
 */
#ifndef IFXEBCU_BF_H
#define IFXEBCU_BF_H 1

/******************************************************************************/

/******************************************************************************/

/** \addtogroup IfxSfr_Ebcu_Registers_BitfieldsMask
 * \{  */
/** \brief Length for Ifx_EBCU_ID_Bits.MOD_REV */
#define IFX_EBCU_ID_MOD_REV_LEN (8u)

/** \brief Mask for Ifx_EBCU_ID_Bits.MOD_REV */
#define IFX_EBCU_ID_MOD_REV_MSK (0xffu)

/** \brief Offset for Ifx_EBCU_ID_Bits.MOD_REV */
#define IFX_EBCU_ID_MOD_REV_OFF (0u)

/** \brief Length for Ifx_EBCU_ID_Bits.MOD_NUMBER */
#define IFX_EBCU_ID_MOD_NUMBER_LEN (8u)

/** \brief Mask for Ifx_EBCU_ID_Bits.MOD_NUMBER */
#define IFX_EBCU_ID_MOD_NUMBER_MSK (0xffu)

/** \brief Offset for Ifx_EBCU_ID_Bits.MOD_NUMBER */
#define IFX_EBCU_ID_MOD_NUMBER_OFF (8u)

/** \brief Length for Ifx_EBCU_CON_Bits.TOUT */
#define IFX_EBCU_CON_TOUT_LEN (16u)

/** \brief Mask for Ifx_EBCU_CON_Bits.TOUT */
#define IFX_EBCU_CON_TOUT_MSK (0xffffu)

/** \brief Offset for Ifx_EBCU_CON_Bits.TOUT */
#define IFX_EBCU_CON_TOUT_OFF (0u)

/** \brief Length for Ifx_EBCU_CON_Bits.DBG */
#define IFX_EBCU_CON_DBG_LEN (1u)

/** \brief Mask for Ifx_EBCU_CON_Bits.DBG */
#define IFX_EBCU_CON_DBG_MSK (0x1u)

/** \brief Offset for Ifx_EBCU_CON_Bits.DBG */
#define IFX_EBCU_CON_DBG_OFF (16u)

/** \brief Length for Ifx_EBCU_CON_Bits.SPC */
#define IFX_EBCU_CON_SPC_LEN (8u)

/** \brief Mask for Ifx_EBCU_CON_Bits.SPC */
#define IFX_EBCU_CON_SPC_MSK (0xffu)

/** \brief Offset for Ifx_EBCU_CON_Bits.SPC */
#define IFX_EBCU_CON_SPC_OFF (24u)

/** \brief Length for Ifx_EBCU_PRIOL_Bits.IOC32P */
#define IFX_EBCU_PRIOL_IOC32P_LEN (4u)

/** \brief Mask for Ifx_EBCU_PRIOL_Bits.IOC32P */
#define IFX_EBCU_PRIOL_IOC32P_MSK (0xfu)

/** \brief Offset for Ifx_EBCU_PRIOL_Bits.IOC32P */
#define IFX_EBCU_PRIOL_IOC32P_OFF (0u)

/** \brief Length for Ifx_EBCU_PRIOL_Bits.IOC32E */
#define IFX_EBCU_PRIOL_IOC32E_LEN (4u)

/** \brief Mask for Ifx_EBCU_PRIOL_Bits.IOC32E */
#define IFX_EBCU_PRIOL_IOC32E_MSK (0xfu)

/** \brief Offset for Ifx_EBCU_PRIOL_Bits.IOC32E */
#define IFX_EBCU_PRIOL_IOC32E_OFF (12u)

/** \brief Length for Ifx_EBCU_PRIOL_Bits.CIF */
#define IFX_EBCU_PRIOL_CIF_LEN (4u)

/** \brief Mask for Ifx_EBCU_PRIOL_Bits.CIF */
#define IFX_EBCU_PRIOL_CIF_MSK (0xfu)

/** \brief Offset for Ifx_EBCU_PRIOL_Bits.CIF */
#define IFX_EBCU_PRIOL_CIF_OFF (16u)

/** \brief Length for Ifx_EBCU_PRIOL_Bits.SFI_S2F */
#define IFX_EBCU_PRIOL_SFI_S2F_LEN (4u)

/** \brief Mask for Ifx_EBCU_PRIOL_Bits.SFI_S2F */
#define IFX_EBCU_PRIOL_SFI_S2F_MSK (0xfu)

/** \brief Offset for Ifx_EBCU_PRIOL_Bits.SFI_S2F */
#define IFX_EBCU_PRIOL_SFI_S2F_OFF (24u)

/** \brief Length for Ifx_EBCU_ECON_Bits.ERRCNT */
#define IFX_EBCU_ECON_ERRCNT_LEN (14u)

/** \brief Mask for Ifx_EBCU_ECON_Bits.ERRCNT */
#define IFX_EBCU_ECON_ERRCNT_MSK (0x3fffu)

/** \brief Offset for Ifx_EBCU_ECON_Bits.ERRCNT */
#define IFX_EBCU_ECON_ERRCNT_OFF (0u)

/** \brief Length for Ifx_EBCU_ECON_Bits.TOUT */
#define IFX_EBCU_ECON_TOUT_LEN (1u)

/** \brief Mask for Ifx_EBCU_ECON_Bits.TOUT */
#define IFX_EBCU_ECON_TOUT_MSK (0x1u)

/** \brief Offset for Ifx_EBCU_ECON_Bits.TOUT */
#define IFX_EBCU_ECON_TOUT_OFF (14u)

/** \brief Length for Ifx_EBCU_ECON_Bits.RDY */
#define IFX_EBCU_ECON_RDY_LEN (1u)

/** \brief Mask for Ifx_EBCU_ECON_Bits.RDY */
#define IFX_EBCU_ECON_RDY_MSK (0x1u)

/** \brief Offset for Ifx_EBCU_ECON_Bits.RDY */
#define IFX_EBCU_ECON_RDY_OFF (15u)

/** \brief Length for Ifx_EBCU_ECON_Bits.ABT */
#define IFX_EBCU_ECON_ABT_LEN (1u)

/** \brief Mask for Ifx_EBCU_ECON_Bits.ABT */
#define IFX_EBCU_ECON_ABT_MSK (0x1u)

/** \brief Offset for Ifx_EBCU_ECON_Bits.ABT */
#define IFX_EBCU_ECON_ABT_OFF (16u)

/** \brief Length for Ifx_EBCU_ECON_Bits.ACK */
#define IFX_EBCU_ECON_ACK_LEN (2u)

/** \brief Mask for Ifx_EBCU_ECON_Bits.ACK */
#define IFX_EBCU_ECON_ACK_MSK (0x3u)

/** \brief Offset for Ifx_EBCU_ECON_Bits.ACK */
#define IFX_EBCU_ECON_ACK_OFF (17u)

/** \brief Length for Ifx_EBCU_ECON_Bits.SVM */
#define IFX_EBCU_ECON_SVM_LEN (1u)

/** \brief Mask for Ifx_EBCU_ECON_Bits.SVM */
#define IFX_EBCU_ECON_SVM_MSK (0x1u)

/** \brief Offset for Ifx_EBCU_ECON_Bits.SVM */
#define IFX_EBCU_ECON_SVM_OFF (19u)

/** \brief Length for Ifx_EBCU_ECON_Bits.WRN */
#define IFX_EBCU_ECON_WRN_LEN (1u)

/** \brief Mask for Ifx_EBCU_ECON_Bits.WRN */
#define IFX_EBCU_ECON_WRN_MSK (0x1u)

/** \brief Offset for Ifx_EBCU_ECON_Bits.WRN */
#define IFX_EBCU_ECON_WRN_OFF (20u)

/** \brief Length for Ifx_EBCU_ECON_Bits.RDN */
#define IFX_EBCU_ECON_RDN_LEN (1u)

/** \brief Mask for Ifx_EBCU_ECON_Bits.RDN */
#define IFX_EBCU_ECON_RDN_MSK (0x1u)

/** \brief Offset for Ifx_EBCU_ECON_Bits.RDN */
#define IFX_EBCU_ECON_RDN_OFF (21u)

/** \brief Length for Ifx_EBCU_ECON_Bits.TAG */
#define IFX_EBCU_ECON_TAG_LEN (6u)

/** \brief Mask for Ifx_EBCU_ECON_Bits.TAG */
#define IFX_EBCU_ECON_TAG_MSK (0x3fu)

/** \brief Offset for Ifx_EBCU_ECON_Bits.TAG */
#define IFX_EBCU_ECON_TAG_OFF (22u)

/** \brief Length for Ifx_EBCU_ECON_Bits.OPC */
#define IFX_EBCU_ECON_OPC_LEN (4u)

/** \brief Mask for Ifx_EBCU_ECON_Bits.OPC */
#define IFX_EBCU_ECON_OPC_MSK (0xfu)

