HAMES2-1st-3/TunnelComfortSystemTesting/include/tc37xa/IfxEbcu_bf.h
/** \brief Length for Ifx_EBCU_DBBOS_Bits.SVM */
#define IFX_EBCU_DBBOS_SVM_LEN (1u)

/** \brief Mask for Ifx_EBCU_DBBOS_Bits.SVM */
#define IFX_EBCU_DBBOS_SVM_MSK (0x1u)

/** \brief Offset for Ifx_EBCU_DBBOS_Bits.SVM */
#define IFX_EBCU_DBBOS_SVM_OFF (4u)

/** \brief Length for Ifx_EBCU_DBBOS_Bits.WR */
#define IFX_EBCU_DBBOS_WR_LEN (1u)

/** \brief Mask for Ifx_EBCU_DBBOS_Bits.WR */
#define IFX_EBCU_DBBOS_WR_MSK (0x1u)

/** \brief Offset for Ifx_EBCU_DBBOS_Bits.WR */
#define IFX_EBCU_DBBOS_WR_OFF (8u)

/** \brief Length for Ifx_EBCU_DBBOS_Bits.RD */
#define IFX_EBCU_DBBOS_RD_LEN (1u)

/** \brief Mask for Ifx_EBCU_DBBOS_Bits.RD */
#define IFX_EBCU_DBBOS_RD_MSK (0x1u)

/** \brief Offset for Ifx_EBCU_DBBOS_Bits.RD */
#define IFX_EBCU_DBBOS_RD_OFF (12u)

/** \brief Length for Ifx_EBCU_DBGNTT_Bits.IOC32P */
#define IFX_EBCU_DBGNTT_IOC32P_LEN (1u)

/** \brief Mask for Ifx_EBCU_DBGNTT_Bits.IOC32P */
#define IFX_EBCU_DBGNTT_IOC32P_MSK (0x1u)

/** \brief Offset for Ifx_EBCU_DBGNTT_Bits.IOC32P */
#define IFX_EBCU_DBGNTT_IOC32P_OFF (0u)

/** \brief Length for Ifx_EBCU_DBGNTT_Bits.IOC32E */
#define IFX_EBCU_DBGNTT_IOC32E_LEN (1u)

/** \brief Mask for Ifx_EBCU_DBGNTT_Bits.IOC32E */
#define IFX_EBCU_DBGNTT_IOC32E_MSK (0x1u)

/** \brief Offset for Ifx_EBCU_DBGNTT_Bits.IOC32E */
#define IFX_EBCU_DBGNTT_IOC32E_OFF (3u)

/** \brief Length for Ifx_EBCU_DBGNTT_Bits.CIF */
#define IFX_EBCU_DBGNTT_CIF_LEN (1u)

/** \brief Mask for Ifx_EBCU_DBGNTT_Bits.CIF */
#define IFX_EBCU_DBGNTT_CIF_MSK (0x1u)

/** \brief Offset for Ifx_EBCU_DBGNTT_Bits.CIF */
#define IFX_EBCU_DBGNTT_CIF_OFF (4u)

/** \brief Length for Ifx_EBCU_DBGNTT_Bits.SFI_S2F */
#define IFX_EBCU_DBGNTT_SFI_S2F_LEN (1u)

/** \brief Mask for Ifx_EBCU_DBGNTT_Bits.SFI_S2F */
#define IFX_EBCU_DBGNTT_SFI_S2F_MSK (0x1u)

/** \brief Offset for Ifx_EBCU_DBGNTT_Bits.SFI_S2F */
#define IFX_EBCU_DBGNTT_SFI_S2F_OFF (6u)

/** \brief Length for Ifx_EBCU_DBADRT_Bits.FPIADR */
#define IFX_EBCU_DBADRT_FPIADR_LEN (32u)

/** \brief Mask for Ifx_EBCU_DBADRT_Bits.FPIADR */
#define IFX_EBCU_DBADRT_FPIADR_MSK (0xffffffffu)

/** \brief Offset for Ifx_EBCU_DBADRT_Bits.FPIADR */
#define IFX_EBCU_DBADRT_FPIADR_OFF (0u)

/** \brief Length for Ifx_EBCU_DBBOST_Bits.FPIOPC */
#define IFX_EBCU_DBBOST_FPIOPC_LEN (4u)

/** \brief Mask for Ifx_EBCU_DBBOST_Bits.FPIOPC */
#define IFX_EBCU_DBBOST_FPIOPC_MSK (0xfu)

/** \brief Offset for Ifx_EBCU_DBBOST_Bits.FPIOPC */
#define IFX_EBCU_DBBOST_FPIOPC_OFF (0u)

/** \brief Length for Ifx_EBCU_DBBOST_Bits.FPISVM */
#define IFX_EBCU_DBBOST_FPISVM_LEN (1u)

/** \brief Mask for Ifx_EBCU_DBBOST_Bits.FPISVM */
#define IFX_EBCU_DBBOST_FPISVM_MSK (0x1u)

/** \brief Offset for Ifx_EBCU_DBBOST_Bits.FPISVM */
#define IFX_EBCU_DBBOST_FPISVM_OFF (4u)

/** \brief Length for Ifx_EBCU_DBBOST_Bits.FPIACK */
#define IFX_EBCU_DBBOST_FPIACK_LEN (2u)

/** \brief Mask for Ifx_EBCU_DBBOST_Bits.FPIACK */
#define IFX_EBCU_DBBOST_FPIACK_MSK (0x3u)

/** \brief Offset for Ifx_EBCU_DBBOST_Bits.FPIACK */
#define IFX_EBCU_DBBOST_FPIACK_OFF (5u)

/** \brief Length for Ifx_EBCU_DBBOST_Bits.FPIRDY */
#define IFX_EBCU_DBBOST_FPIRDY_LEN (1u)

/** \brief Mask for Ifx_EBCU_DBBOST_Bits.FPIRDY */
#define IFX_EBCU_DBBOST_FPIRDY_MSK (0x1u)

/** \brief Offset for Ifx_EBCU_DBBOST_Bits.FPIRDY */
#define IFX_EBCU_DBBOST_FPIRDY_OFF (7u)

/** \brief Length for Ifx_EBCU_DBBOST_Bits.FPIWR */
#define IFX_EBCU_DBBOST_FPIWR_LEN (1u)

/** \brief Mask for Ifx_EBCU_DBBOST_Bits.FPIWR */
#define IFX_EBCU_DBBOST_FPIWR_MSK (0x1u)

/** \brief Offset for Ifx_EBCU_DBBOST_Bits.FPIWR */
#define IFX_EBCU_DBBOST_FPIWR_OFF (8u)

/** \brief Length for Ifx_EBCU_DBBOST_Bits.FPIRST */
#define IFX_EBCU_DBBOST_FPIRST_LEN (2u)

/** \brief Mask for Ifx_EBCU_DBBOST_Bits.FPIRST */
#define IFX_EBCU_DBBOST_FPIRST_MSK (0x3u)

/** \brief Offset for Ifx_EBCU_DBBOST_Bits.FPIRST */
#define IFX_EBCU_DBBOST_FPIRST_OFF (9u)

/** \brief Length for Ifx_EBCU_DBBOST_Bits.FPIOPS */
#define IFX_EBCU_DBBOST_FPIOPS_LEN (1u)

/** \brief Mask for Ifx_EBCU_DBBOST_Bits.FPIOPS */
#define IFX_EBCU_DBBOST_FPIOPS_MSK (0x1u)

/** \brief Offset for Ifx_EBCU_DBBOST_Bits.FPIOPS */
#define IFX_EBCU_DBBOST_FPIOPS_OFF (11u)

/** \brief Length for Ifx_EBCU_DBBOST_Bits.FPIRD */
#define IFX_EBCU_DBBOST_FPIRD_LEN (1u)

/** \brief Mask for Ifx_EBCU_DBBOST_Bits.FPIRD */
#define IFX_EBCU_DBBOST_FPIRD_MSK (0x1u)

/** \brief Offset for Ifx_EBCU_DBBOST_Bits.FPIRD */
#define IFX_EBCU_DBBOST_FPIRD_OFF (12u)

/** \brief Length for Ifx_EBCU_DBBOST_Bits.FPIABORT */
#define IFX_EBCU_DBBOST_FPIABORT_LEN (1u)

/** \brief Mask for Ifx_EBCU_DBBOST_Bits.FPIABORT */
#define IFX_EBCU_DBBOST_FPIABORT_MSK (0x1u)

/** \brief Offset for Ifx_EBCU_DBBOST_Bits.FPIABORT */
#define IFX_EBCU_DBBOST_FPIABORT_OFF (13u)

/** \brief Length for Ifx_EBCU_DBBOST_Bits.FPITOUT */
#define IFX_EBCU_DBBOST_FPITOUT_LEN (1u)

/** \brief Mask for Ifx_EBCU_DBBOST_Bits.FPITOUT */
#define IFX_EBCU_DBBOST_FPITOUT_MSK (0x1u)

/** \brief Offset for Ifx_EBCU_DBBOST_Bits.FPITOUT */
#define IFX_EBCU_DBBOST_FPITOUT_OFF (14u)

/** \brief Length for Ifx_EBCU_DBBOST_Bits.ENDINIT */
#define IFX_EBCU_DBBOST_ENDINIT_LEN (1u)

/** \brief Mask for Ifx_EBCU_DBBOST_Bits.ENDINIT */
#define IFX_EBCU_DBBOST_ENDINIT_MSK (0x1u)

/** \brief Offset for Ifx_EBCU_DBBOST_Bits.ENDINIT */
#define IFX_EBCU_DBBOST_ENDINIT_OFF (15u)

/** \brief Length for Ifx_EBCU_DBBOST_Bits.FPITAG */
#define IFX_EBCU_DBBOST_FPITAG_LEN (6u)

/** \brief Mask for Ifx_EBCU_DBBOST_Bits.FPITAG */
#define IFX_EBCU_DBBOST_FPITAG_MSK (0x3fu)

/** \brief Offset for Ifx_EBCU_DBBOST_Bits.FPITAG */
#define IFX_EBCU_DBBOST_FPITAG_OFF (16u)

/** \brief Length for Ifx_EBCU_DBDAT_Bits.FPIDATA */
#define IFX_EBCU_DBDAT_FPIDATA_LEN (32u)

/** \brief Mask for Ifx_EBCU_DBDAT_Bits.FPIDATA */
#define IFX_EBCU_DBDAT_FPIDATA_MSK (0xffffffffu)

/** \brief Offset for Ifx_EBCU_DBDAT_Bits.FPIDATA */
#define IFX_EBCU_DBDAT_FPIDATA_OFF (0u)

/** \brief Length for Ifx_EBCU_ALSTAT_Bits.AL00 */
#define IFX_EBCU_ALSTAT_AL00_LEN (1u)

/** \brief Mask for Ifx_EBCU_ALSTAT_Bits.AL00 */
#define IFX_EBCU_ALSTAT_AL00_MSK (0x1u)

/** \brief Offset for Ifx_EBCU_ALSTAT_Bits.AL00 */
#define IFX_EBCU_ALSTAT_AL00_OFF (0u)

/** \brief Length for Ifx_EBCU_ALSTAT_Bits.AL01 */
#define IFX_EBCU_ALSTAT_AL01_LEN (1u)

/** \brief Mask for Ifx_EBCU_ALSTAT_Bits.AL01 */
#define IFX_EBCU_ALSTAT_AL01_MSK (0x1u)

/** \brief Offset for Ifx_EBCU_ALSTAT_Bits.AL01 */
#define IFX_EBCU_ALSTAT_AL01_OFF (1u)

