HAMES2-1st-3/TunnelComfortSystemTesting/include/tc37xa/IfxEbcu_bf.h
/** \brief Length for Ifx_EBCU_ALSTAT_Bits.AL02 */
#define IFX_EBCU_ALSTAT_AL02_LEN (1u)

/** \brief Mask for Ifx_EBCU_ALSTAT_Bits.AL02 */
#define IFX_EBCU_ALSTAT_AL02_MSK (0x1u)

/** \brief Offset for Ifx_EBCU_ALSTAT_Bits.AL02 */
#define IFX_EBCU_ALSTAT_AL02_OFF (2u)

/** \brief Length for Ifx_EBCU_ALSTAT_Bits.AL03 */
#define IFX_EBCU_ALSTAT_AL03_LEN (1u)

/** \brief Mask for Ifx_EBCU_ALSTAT_Bits.AL03 */
#define IFX_EBCU_ALSTAT_AL03_MSK (0x1u)

/** \brief Offset for Ifx_EBCU_ALSTAT_Bits.AL03 */
#define IFX_EBCU_ALSTAT_AL03_OFF (3u)

/** \brief Length for Ifx_EBCU_ALSTAT_Bits.AL04 */
#define IFX_EBCU_ALSTAT_AL04_LEN (1u)

/** \brief Mask for Ifx_EBCU_ALSTAT_Bits.AL04 */
#define IFX_EBCU_ALSTAT_AL04_MSK (0x1u)

/** \brief Offset for Ifx_EBCU_ALSTAT_Bits.AL04 */
#define IFX_EBCU_ALSTAT_AL04_OFF (4u)

/** \brief Length for Ifx_EBCU_ALSTAT_Bits.AL05 */
#define IFX_EBCU_ALSTAT_AL05_LEN (1u)

/** \brief Mask for Ifx_EBCU_ALSTAT_Bits.AL05 */
#define IFX_EBCU_ALSTAT_AL05_MSK (0x1u)

/** \brief Offset for Ifx_EBCU_ALSTAT_Bits.AL05 */
#define IFX_EBCU_ALSTAT_AL05_OFF (5u)

/** \brief Length for Ifx_EBCU_ALSTAT_Bits.AL06 */
#define IFX_EBCU_ALSTAT_AL06_LEN (1u)

/** \brief Mask for Ifx_EBCU_ALSTAT_Bits.AL06 */
#define IFX_EBCU_ALSTAT_AL06_MSK (0x1u)

/** \brief Offset for Ifx_EBCU_ALSTAT_Bits.AL06 */
#define IFX_EBCU_ALSTAT_AL06_OFF (6u)

/** \brief Length for Ifx_EBCU_ALSTAT_Bits.AL07 */
#define IFX_EBCU_ALSTAT_AL07_LEN (1u)

/** \brief Mask for Ifx_EBCU_ALSTAT_Bits.AL07 */
#define IFX_EBCU_ALSTAT_AL07_MSK (0x1u)

/** \brief Offset for Ifx_EBCU_ALSTAT_Bits.AL07 */
#define IFX_EBCU_ALSTAT_AL07_OFF (7u)

/** \brief Length for Ifx_EBCU_ALSTAT_Bits.AL08 */
#define IFX_EBCU_ALSTAT_AL08_LEN (1u)

/** \brief Mask for Ifx_EBCU_ALSTAT_Bits.AL08 */
#define IFX_EBCU_ALSTAT_AL08_MSK (0x1u)

/** \brief Offset for Ifx_EBCU_ALSTAT_Bits.AL08 */
#define IFX_EBCU_ALSTAT_AL08_OFF (8u)

/** \brief Length for Ifx_EBCU_ALSTAT_Bits.AL09 */
#define IFX_EBCU_ALSTAT_AL09_LEN (1u)

/** \brief Mask for Ifx_EBCU_ALSTAT_Bits.AL09 */
#define IFX_EBCU_ALSTAT_AL09_MSK (0x1u)

/** \brief Offset for Ifx_EBCU_ALSTAT_Bits.AL09 */
#define IFX_EBCU_ALSTAT_AL09_OFF (9u)

/** \brief Length for Ifx_EBCU_ALSTAT_Bits.AL10 */
#define IFX_EBCU_ALSTAT_AL10_LEN (1u)

/** \brief Mask for Ifx_EBCU_ALSTAT_Bits.AL10 */
#define IFX_EBCU_ALSTAT_AL10_MSK (0x1u)

/** \brief Offset for Ifx_EBCU_ALSTAT_Bits.AL10 */
#define IFX_EBCU_ALSTAT_AL10_OFF (10u)

/** \brief Length for Ifx_EBCU_ALSTAT_Bits.AL11 */
#define IFX_EBCU_ALSTAT_AL11_LEN (1u)

/** \brief Mask for Ifx_EBCU_ALSTAT_Bits.AL11 */
#define IFX_EBCU_ALSTAT_AL11_MSK (0x1u)

/** \brief Offset for Ifx_EBCU_ALSTAT_Bits.AL11 */
#define IFX_EBCU_ALSTAT_AL11_OFF (11u)

/** \brief Length for Ifx_EBCU_ALSTAT_Bits.AL12 */
#define IFX_EBCU_ALSTAT_AL12_LEN (1u)

/** \brief Mask for Ifx_EBCU_ALSTAT_Bits.AL12 */
#define IFX_EBCU_ALSTAT_AL12_MSK (0x1u)

/** \brief Offset for Ifx_EBCU_ALSTAT_Bits.AL12 */
#define IFX_EBCU_ALSTAT_AL12_OFF (12u)

/** \brief Length for Ifx_EBCU_ALSTAT_Bits.AL13 */
#define IFX_EBCU_ALSTAT_AL13_LEN (1u)

/** \brief Mask for Ifx_EBCU_ALSTAT_Bits.AL13 */
#define IFX_EBCU_ALSTAT_AL13_MSK (0x1u)

/** \brief Offset for Ifx_EBCU_ALSTAT_Bits.AL13 */
#define IFX_EBCU_ALSTAT_AL13_OFF (13u)

/** \brief Length for Ifx_EBCU_ALSTAT_Bits.AL14 */
#define IFX_EBCU_ALSTAT_AL14_LEN (1u)

/** \brief Mask for Ifx_EBCU_ALSTAT_Bits.AL14 */
#define IFX_EBCU_ALSTAT_AL14_MSK (0x1u)

/** \brief Offset for Ifx_EBCU_ALSTAT_Bits.AL14 */
#define IFX_EBCU_ALSTAT_AL14_OFF (14u)

/** \brief Length for Ifx_EBCU_ALSTAT_Bits.AL15 */
#define IFX_EBCU_ALSTAT_AL15_LEN (1u)

/** \brief Mask for Ifx_EBCU_ALSTAT_Bits.AL15 */
#define IFX_EBCU_ALSTAT_AL15_MSK (0x1u)

/** \brief Offset for Ifx_EBCU_ALSTAT_Bits.AL15 */
#define IFX_EBCU_ALSTAT_AL15_OFF (15u)

/** \brief Length for Ifx_EBCU_ALSTAT_Bits.AL16 */
#define IFX_EBCU_ALSTAT_AL16_LEN (1u)

/** \brief Mask for Ifx_EBCU_ALSTAT_Bits.AL16 */
#define IFX_EBCU_ALSTAT_AL16_MSK (0x1u)

/** \brief Offset for Ifx_EBCU_ALSTAT_Bits.AL16 */
#define IFX_EBCU_ALSTAT_AL16_OFF (16u)

/** \brief Length for Ifx_EBCU_ALSTAT_Bits.AL17 */
#define IFX_EBCU_ALSTAT_AL17_LEN (1u)

/** \brief Mask for Ifx_EBCU_ALSTAT_Bits.AL17 */
#define IFX_EBCU_ALSTAT_AL17_MSK (0x1u)

/** \brief Offset for Ifx_EBCU_ALSTAT_Bits.AL17 */
#define IFX_EBCU_ALSTAT_AL17_OFF (17u)

/** \brief Length for Ifx_EBCU_ALSTAT_Bits.AL18 */
#define IFX_EBCU_ALSTAT_AL18_LEN (1u)

/** \brief Mask for Ifx_EBCU_ALSTAT_Bits.AL18 */
#define IFX_EBCU_ALSTAT_AL18_MSK (0x1u)

/** \brief Offset for Ifx_EBCU_ALSTAT_Bits.AL18 */
#define IFX_EBCU_ALSTAT_AL18_OFF (18u)

/** \brief Length for Ifx_EBCU_ALSTAT_Bits.AL19 */
#define IFX_EBCU_ALSTAT_AL19_LEN (1u)

/** \brief Mask for Ifx_EBCU_ALSTAT_Bits.AL19 */
#define IFX_EBCU_ALSTAT_AL19_MSK (0x1u)

/** \brief Offset for Ifx_EBCU_ALSTAT_Bits.AL19 */
#define IFX_EBCU_ALSTAT_AL19_OFF (19u)

/** \brief Length for Ifx_EBCU_ALSTAT_Bits.AL20 */
#define IFX_EBCU_ALSTAT_AL20_LEN (1u)

/** \brief Mask for Ifx_EBCU_ALSTAT_Bits.AL20 */
#define IFX_EBCU_ALSTAT_AL20_MSK (0x1u)

/** \brief Offset for Ifx_EBCU_ALSTAT_Bits.AL20 */
#define IFX_EBCU_ALSTAT_AL20_OFF (20u)

/** \brief Length for Ifx_EBCU_ALSTAT_Bits.AL21 */
#define IFX_EBCU_ALSTAT_AL21_LEN (1u)

/** \brief Mask for Ifx_EBCU_ALSTAT_Bits.AL21 */
#define IFX_EBCU_ALSTAT_AL21_MSK (0x1u)

/** \brief Offset for Ifx_EBCU_ALSTAT_Bits.AL21 */
#define IFX_EBCU_ALSTAT_AL21_OFF (21u)

/** \brief Length for Ifx_EBCU_ALSTAT_Bits.AL22 */
#define IFX_EBCU_ALSTAT_AL22_LEN (1u)

/** \brief Mask for Ifx_EBCU_ALSTAT_Bits.AL22 */
#define IFX_EBCU_ALSTAT_AL22_MSK (0x1u)

/** \brief Offset for Ifx_EBCU_ALSTAT_Bits.AL22 */
#define IFX_EBCU_ALSTAT_AL22_OFF (22u)

/** \brief Length for Ifx_EBCU_ALSTAT_Bits.AL23 */
#define IFX_EBCU_ALSTAT_AL23_LEN (1u)

/** \brief Mask for Ifx_EBCU_ALSTAT_Bits.AL23 */
#define IFX_EBCU_ALSTAT_AL23_MSK (0x1u)

/** \brief Offset for Ifx_EBCU_ALSTAT_Bits.AL23 */
#define IFX_EBCU_ALSTAT_AL23_OFF (23u)

/** \brief Length for Ifx_EBCU_ALSTAT_Bits.AL24 */
#define IFX_EBCU_ALSTAT_AL24_LEN (1u)

